Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Subnormal values do not use the full precision available to values of a type.
ja: サブノーマル値は、ある型の値に利用可能な完全な精度を使うことはできません。

source: Subscripts
ja: 添え字

source: Subsequent invocations of other NSApple Event Manager methods using the same suspension ID are invalid.
ja: 同じ休止IDを使ったNSApple Event Managerメソッドの引き続いての発動は、無効です。

source: Subsequent messages to the receiver may generate an error indicating that a message was sent to a deallocated object (provided the deallocated memory hasn’t been reused yet).
ja: その後に起こるレシーバへのメッセージは、割り当て解除されたオブジェクトにメッセージが送られたことを指し示すエラーを生成します（割り当て解除されたメモリがまだ再利用されていないという条件で）。

source: Subsequent transformations cause coordinates to be shifted by delta X units along the x axis and by delta Y units along the y axis.
ja: そのあとに続く変換は、座標がx軸に沿ってdelta X単位だけそしてy軸に沿ってdelta Y単位だけずらされます。

source: Subtracts right Operand from left Operand and stores the difference, possibly rounded off according to rounding Mode, in result.
ja: right Operandをleft Operandから減じます、そして可能ならrounding Modeにしたがって丸めて、resultに差を格納します。

source: Subtracts a time interval from a date.
ja: ある日付から時間間隔を引きます。

source: Subtracts one decimal number from another, storing the result in the first number.
ja: ある10進数を別のものから引きます、結果を最初の数に格納します。

source: Subtracts one decimal number from another.
ja: ある10進数を別のものから引きます。

source: Subtracts one decimal value from another.
ja: ある10進数値を別のものから引きます。

source: Such modifications are used only when displaying the file or directory to the user and do not reflect the actual path to the item in the file system.
ja: そのような修正は、ファイルやディレクトリをユーザに表示する場合にのみ使われます、そしてファイルシステムの中の項目への実際のパスを反映しません。

source: Superclasses receive this message before their subclasses.
ja: スーパークラスは、このメッセージをそれらのサブクラスの前に受け取ります。

source: Supported applications (/Applications).
ja: サポートされるアプリケーション（/Applications）。

source: Supporting Types
ja: 支援を行う型

source: Suspending and Resuming Notification Delivery
ja: 通知配達の待機と再開

source: Suspending and resuming Apple events
ja: アップルイベントの休止と再開

source: Suspends or resumes notification delivery.
ja: 通知配達を待機または再開します。

source: Suspends the handling of the current event and returns an ID that must be used to resume the handling of the event if an Apple event is being handled on the current thread.
ja: 現在のイベントの処理を休止して、アップルイベントが現在のスレッド上で処理されているならば、そのイベントの処理を再開するために使われなければならないIDを返します。

source: Swaps the bytes of inv and returns the resulting value.
ja: invのバイトをスワップして、結果の値を返します。

source: Swaps the bytes of iv and returns the resulting value.
ja: ivのバイトをスワップして、結果の値を返します。

source: Swaps the bytes of x and returns the resulting value.
ja: xのバイトをスワップして、結果の値を返します。

source: Swaps the bytes of a number.
ja: ある数のバイトそれらをスワップします。

source: Swaps the low-order and high-order bytes of inv and returns the resulting value.
ja: invの下位および上位バイトをスワップして、結果の値を返します。

source: Swift Standard Library
ja: Swif標準ライブラリ

source: Symbolic link
ja: シンボリックリンク

source: Synchronously reads data up to the specified number of bytes.
ja: 指定されたバイト数に至るまでデータを同期的に読み込みます。

source: Synchronously reads the available data up to the end of file or maximum number of bytes.
ja: ファイル終端または最大限度バイト数に至るまで利用可能なデータを同期的に読み込みます。

source: Synchronously writes the specified data to the receiver.
ja: 指定されたデータをレシーバに同期的に書き込みます。

source: System and network administration applications.
ja: システムおよびネットワーク管理アプリケーション。

source: Table 1
ja: 表 1

source: Table 2
ja: 表２

source: Table 3
ja: 表 3

source: Table 4
ja: 表 4

source: Task Management
ja: タスク管理

source: Tells the accessibility element to decrement the value of its content.
ja: アクセシビリティ要素に、それの内容の値を漸減するように言います。

source: Tells the accessibility element to increment the value of its content.
ja: アクセシビリティ要素にそれの内容の値を漸増するように言います。

source: Tells the element to activate itself and report the success or failure of the operation.
ja: 要素にそれ自身をアクティブにするように言って、その操作の成功または失敗を報告します。

source: Template Matching Format
ja: テンプレートマッチング書式

source: Terminates a \Q ... \E quoted sequence.
ja: \Q ... \E引用部を終了します。

source: Testing Class Functionality
ja: クラスの機能性のテスト

source: Testing Protocol Conformance
ja: プロトコル準拠のテスト

source: Testing Set Membership
ja: 集合メンバーシップをテストする

source: Testing for Inclusion in the Range
ja: 範囲における包含についてテストする

source: Text Checking Result Components
ja: テキストチェック結果構成要素

source: Text Checking Results for Addresses
ja: アドレスに対するテキストチェックの結果

source: Text Checking Results for Regular Expressions
ja: 正規表現のテキストチェック結果

source: Text Checking Results for Text Replacement
ja: テキスト置き換えのテキストチェック結果

source: Text Checking Results for URLs
ja: URLに対するテキストチェックの結果

source: Text Checking Type Range and Type
ja: テキストチェック型の範囲と型

source: That is, for any elements a, b, and c, the following conditions must hold:
ja: すなわち、何らかの要素a、b、そしてcに対して、以下の条件が保持されなければなりません：

source: That will take into account complexities like daylight saving time, months with different numbers of days, and more.
ja: それは、サマータイム、異なる数の日にちを持つ月、その他のような複雑さを考慮に入れます。

source: The indices are one-based.
ja: このインデックスは、１起点です。

source: The "adaptive" algorithm is platform specific and uses a different number of fraction digits based on the magnitude (in OS X v10.8: 0 fraction digits for bytes and KB; 1 fraction digits for MB; 2 for GB and above).
ja: この "適応性" アルゴリズムはプラットホーム固有です、そして規模に基づいて異なる小数桁数を使います（OS X v10.8：バイト数とKBでは小数桁０；MBでは小数桁１；GB以上では２）。

source: The 32-bit Intel architecture.
ja: 32ビットインテルアーキテクチャ。

source: The 32-bit PowerPC architecture.
ja: 32ビットPowerPCアーキテクチャ。

source: The 64-bit Intel architecture.
ja: 64ビットインテルアーキテクチャ。

source: The 64-bit PowerPC architecture.
ja: 64ビットPowerPCアーキテクチャ。

source: The NSAffine Transform Struct structure is an alternate representation of a transformation matrix that can be used to specify matrix values directly.
ja: NSAffine Transform Struct構造体は、変換行列の代替の表現です、それは行列値を直接に指定するために使われることができます。

source: The NSApplication class automatically suspends distributed notification delivery when the application is not active.
ja: NSApplicationクラスは、アプリケーションがアクティブでない場合、自動的に分散通知配達を待機します。

source: The NSRegular Expression .Matching Flags matching flag is set in the flags passed to the block if matching failed due to an internal error (such as an expression requiring exponential memory allocations) without examining the entire search range.
ja: マッチングが全ての検索範囲を調べることなく内部エラー（例えば急激に増すメモリ割当てを必要としているある表現）のために失敗するならば、NSRegular Expression .Matching Flagsマッチングフラグがブロックに渡されるflagsで設定されます。

source: The NSURL for the requested directory.
ja: 要請されたディレクトリに対するNSURL。

source: The URLCache class stores and retrieves instances of Cached URLResponse.
ja: URLCacheクラスは、Cached URLResponseのインスタンスを格納および回収します。

source: The allowed Units property determines which date components are actually used to generate the string.
ja: allowed Unitsプロパティは、どの日付構成要素が実際に文字列を生成するのに使われるかを決定します。

source: The anchored, with Transparent Bounds, and without Anchoring Bounds regular expression options, specified in the options property specified when the regular expression instance is created, can apply to any match or replace method.
ja: 正規表現インスタンスがつくられる時に指定されるoptionsプロパティにおいて指定される、anchored、with Transparent Bounds、そしてwithout Anchoring Bounds正規表現オプションは、あらゆるマッチまたは置換メソッドに適用されます。

source: The first Match(in: options: range:) method is similar to matches(in: options: range:) but it returns only the first match.
ja: first Match(in: options: range:)メソッドはmatches(in: options: range:)に似ています、しかしそれは最初のマッチだけを返します。

source: The hit End matching flag is set in the flags passed to the Block if the current match operation reached the end of the search range.
ja: 現在のマッチ操作が検索範囲の終端に達するならば、hit Endマッチングフラグが「ブロック」に渡されるflagsにおいて設定されます。

source: The matches(in: options: range:) returns all the matching results.
ja: matches(in: options: range:)は、全てのマッチした結果を返します。

source: The number Of Matches(in: options: range:) method provides a simple mechanism for counting the number of matches in a given range of a string.
ja: number Of Matches(in: options: range:)メソッドは、ある文字列の与えられた範囲においてマッチの数を数えるために、単純な仕組みを提供します。

source: The posix Permissions value must be initialized with the code representing the POSIX file-permissions bit pattern.
ja: posix Permissions値は、POSIXファイル権限ビットパターンを表しているコードで初期化されなければなりません。

source: The string(from: to:) method may be called safely from any thread of your app.
ja: string(from: to:)メソッドは、あなたのアプリのあらゆるスレッドから安全に呼び出されるかもしれません。

source: The Constants section lists the global constants used as keys in the attributes dictionary.
ja: 定数の節は、attributes辞書においてキーとして使われるグローバル定数を一覧にします。

source: The NSHash Table Call Backs structure call Backs has five pointers to functions, with the following defaults: pointer hashing, if hash is NULL; pointer equality, if is Equal is NULL; no callback upon adding an element, if retain is NULL; no callback upon removing an element, if release is NULL; and a function returning a pointer’s hexadecimal value as a string, if describe is NULL.
ja: NSHash Table Call Backs構造体call Backsは、関数への五つのポインタを、以下の初期状態とともに持ちます：hashがNULLならば、ボインタのハッシュ化；is EqualがNULLならば、ポインタ同等性；retainがNULLならば、要素の追加に関してコールバックなし；releaseがNULLならば、要素の削除に関してコールバックなし；そしてdescribeがNULLならば、ポインタの16進数値を文字列として返す関数。

source: The NSMap Table Key Call Backs arguments are structures that are very similar to the callback structure used by NSCreate Hash Table(_: _:); in fact, they have the same defaults as documented for that function.
ja: NSMap Table Key Call Backs引数それぞれは構造体です、それはNSCreate Hash Table(_: _:)によって使われるコールバック構造体と大変よく似ています；実際、それらはその関数について文書化されるのと同じ初期設定を持ちます。

source: The required End matching flag is set in the flags passed to the Block if the current match depended on the location of the end of the search range.
ja: 現在のマッチが検索範囲の終端の場所に依存するならば、required Endマッチングフラグが「ブロック」に渡されるflagsにおいて設定されます。

source: The NSMap Table Key Call Backs arguments are structures that are very similar to the callback structure used by NSCreate Hash Table(_: _:)—they have the same defaults as documented for that function.
ja: NSMap Table Key Call Backs引数それぞれは構造体です、それはNSCreate Hash Table(_: _:)によって使われるコールバック構造体と大変よく似ています — それらはその関数について文書化されるのと同じ初期設定を持ちます。

source: The use Default or use All constants can be used with the C AND or the C NOT operators to create custom formats as well.
ja: use Defaultまたはuse All定数は、C ANDまたはC NOT演算子とともに使われて、あつらえの書式も作成できます。

source: The AEDesc structure encapsulated by the receiver, if it has one.
ja: レシーバによってカプセル化されたAEDesc構造体、それがこれを持つならば。

source: The Block Operation class is a concrete subclass of Operation that manages the concurrent execution of one or more blocks.
ja: Block Operationクラスは、Operationの具体的なサブクラスです、それは、１つ以上のブロックの並列実行を管理します。

source: The Bundle class has many constructors, but the one you use most often is main.
ja: Bundleクラスは多くのコンストラクタを持ちます、しかしあなたが最もよく使うものはmainです。

source: The Bundle class hides this underlying structure in most (but not all) cases.
ja: Bundleクラスは、たいていの場合（しかし全てではない）この基底構造を隠します。

source: The Class object for class Name.
ja: class Nameに対するClassオブジェクト。

source: The Data value type allows simple byte buffers to take on the behavior of Foundation objects.
ja: Data値型は、単純なバイトバッファにFoundationオブジェクトの挙動を取ることを可能にします。

source: The Date at which to start the search.
ja: それで検索を開始するところのDate。

source: The Date structure provides methods for comparing dates, calculating the time interval between two dates, and creating a new date from a time interval relative to another date.
ja: Date構造体は、日付を比較する、２つの日付の時間間隔を計算する、そして別の日付と相対してある時間間隔から新しい日付を作成するメソッドを提供します。

source: The Date to use.
ja: 使用するDate。

source: The Date Components to use as input to the search algorithm.
ja: 検索アルゴリズムへの入力として使うDate Components。

source: The File Manager Delegate protocol defines optional methods for managing operations involving the copying, moving, linking, or removal of files and directories.
ja: File Manager Delegateプロトコルは、ファイルおよびディレクトリのコピー、移動、リンク、または削除を伴う演算を管理するために任意のメソッドを定義します。

source: The File Wrapper class provides access to the attributes and contents of file system nodes.
ja: File Wrapperクラスは、ファイルシステムノードの属性と内容へのアクセスを提供します。

source: The HTTPURLResponse class is a subclass of URLResponse that provides methods for accessing information specific to HTTP protocol responses.
ja: HTTPURLResponseクラスは、URLResponseのサブクラスの１つです、それはHTTPプロトコル応答に特有の情報にアクセスするためのメソッドを提供します。

source: The Host class provides methods to access the network name and address information for a host.
ja: Hostクラスは、あるホストに対するネットワーク名とアドレス情報にアクセスするメソッドを提供します。

source: The ISO8601Date Formatter class generates and parses string representations of dates following the ISO 8601 standard.
ja: ISO8601Date Formatterクラスは、日付の文字列表現をISO 8601規格に従って生成および構文解析します。

source: The NSBundle object corresponding to the bundle directory that contains the current executable.
ja: 現在の実行可能ファイルを含んでいるバンドルディレクトリに一致するNSBundleオブジェクト。

source: The NSBundle object with the bundle identifier identifier, or nil if the requested bundle is not found on the system.
ja: NSBundleオブジェクトでバンドル識別子identifierを持つもの、または要求されたバンドルがシステム上で見つけられないならばnil。

source: The NSCached URLResponse object, initialized using the given data.
ja: NSCached URLResponseオブジェクト、与えられたデータを使って初期化されます。

source: The NSCoder abstract class declares the interface used by concrete subclasses to transfer objects and other values between memory and some other format.
ja: NSCoder抽象クラスは、具体的なサブクラスによって、オブジェクトと他の値をメモリと何か他の形式との間で移し換えるために使われるインターフェイスを宣言します。

source: The NSCoding protocol declares the two methods that a class must implement so that instances of that class can be encoded and decoded.
ja: NSCodingプロトコルは、２つのメソッドを宣言します、それはそのクラスのインスタンスがエンコードおよびデコードされることができるために、あるクラスが実装する必要があるものです。

source: The NSDictionary class declares the programmatic interface to objects that manage immutable associations of keys and values.
ja: NSDictionaryクラスは、不変のキーと値関係を管理するオブジェクトに対するプログラムインターフェイスを宣言します。

source: The NSDirectory Enumerator class has methods for obtaining the attributes of the existing path and of the parent directory and for skipping descendants of the existing path.
ja: NSDirectory Enumeratorクラスは、既存のパスのそして親ディレクトリの属性を取得するための、そして既存のパスの子孫を飛ばして省くためのメソッドを持ちます。

source: The NSDownloads Directory flag will only produce a path only when the NSUser Domain Mask is provided.
ja: NSDownloads Directoryフラグは、NSUser Domain Maskが提供される場合にのみ、パスを生成するだけです。

source: The NSError Recovery Attempting informal protocol provides methods that allow your application to attempt to recover from an error.
ja: NSError Recovery Attempting非形式プロトコルは、あなたのアプリケーションにひとつのエラーから復旧することを試みるのを可能にするメソッドを提供します。

source: The NSExtension Request Handling protocol provides a life cycle hook into an app extension.
ja: NSExtension Request Handlingプロトコルは、あるアプリ拡張へとつなぐ（フックする）あるライフサイクルを提供します。

source: The NSFile Coordinator class coordinates the reading and writing of files and directories among multiple processes and objects in the same process.
ja: NSFile Coordinatorクラスは、複数のプロセスおよび同じプロセス中の複数のオブジェクトの間でファイルとディレクトリの読み込みと書き出しを調整します。

source: The NSFile Manager object that sent this message.
ja: このメッセージを送り出すNSFile Managerオブジェクト。

source: The NSFile Posix Permissions value must be initialized with the code representing the POSIX file-permissions bit pattern.
ja: NSFile Posix Permissions値は、POSIXファイル権限ビットパターンを表しているコードで初期化されなければなりません。

source: The NSImage object associated with the specified name, or nil if no file is found.
ja: 指定された名前と結びつけられたNSImageオブジェクト、またはファイルが見つからないならばnil。

source: The NSMetadata Query Attribute Value Tuple class represents attribute-value tuples, which are objects that contain the attribute name and value of a metadata attribute.
ja: NSMetadata Query Attribute Value Tupleクラスは「属性値」タプルを表します、それは、あるメタデータ属性の属性名と値を含んでいるオブジェクトです。

source: The NSMutable Array class declares the programmatic interface to objects that manage a modifiable array of objects.
ja: NSMutable Arrayクラスは、いくらかのオブジェクトからなる変更可能な配列を管理するオブジェクトに対するプログラムインターフェイスを宣言します。

source: The NSMutable Character Set class declares the programmatic interface to objects that manage a modifiable set of Unicode characters.
ja: NSMutable Character Setクラスは、変更可能なユニコード文字集合を管理するオブジェクトに対するプログラムインターフェイスを宣言します。

source: The NSMutable Copying protocol declares a method for providing mutable copies of an object.
ja: NSMutable Copyingプロトコルは、あるオブジェクトの可変のコピーを提供するためのメソッドを宣言します。

source: The NSMutable Dictionary class declares the programmatic interface to objects that manage mutable associations of keys and values.
ja: NSMutable Dictionaryクラスは、不変のキーと値関係を管理するオブジェクトに対するプログラムインターフェイスを宣言します

source: The NSMutable Set class declares the programmatic interface to a mutable, unordered collection of distinct objects.
ja: NSMutable Setクラスは、それぞれが特有なオブジェクトからなる可変の、順番付けられないコレクションに対するプログラムインターフェイスを宣言します。

source: The NSMutable String class declares the programmatic interface to an object that manages a mutable string—that is, a string whose contents can be edited—that conceptually represents an array of Unicode characters.
ja: NSMutable Stringクラスは、可変の文字列 — すなわち、編集されることができる文字列 — を管理するオブジェクトに対するプログラムインターフェイスを宣言します、それは概念的にはユニコード文字の配列を表します。

source: The NSRegular Expression class provides find-and-replace methods for both immutable and mutable strings using the technique of template matching.
ja: NSRegular Expressionクラスは、検索置換メソッドをテンプレート（ひな形）マッチングのテクニックを使用して不変および可変の文字列両方のために用意します。

source: The NSURLAuthentication Challenge Sender protocol represents the interface that the sender of an authentication challenge must implement.
ja: NSURLAuthentication Challenge Senderプロトコルは、インターフェイスを表します、それは認証要求の発送人（センダー）が実装しなければならないものです。

source: The NSURLDownload Delegate protocol defines methods that allow an object to receive informational callbacks about the asynchronous load of a download’s URL request.
ja: NSURLDownload Delegateプロトコルは、あるダウンロードの持つURLリクエストの非同期ロードについてのコールバック情報を受け取ることをあるオブジェクトに可能にするメソッドを定義します。

source: The NSURLSession Task Delegate protocol defines the task-specific delegate methods that you should implement when working with any type of URLSession task.
ja: NSURLSession Task Delegateプロトコルは、タスク特有のデリゲートメソッドを定義します、それはあなたがURLSessionタスクの何らかの型を扱う時に実装するべきものです。

source: The NSUser Apple Script Task class is intended to run AppleScript scripts from your application.
ja: NSUser Apple Script Taskクラスは、AppleScriptスクリプトをあなたのアプリケーションから実行するためのものです。

source: The NSUser Automator Task class is intended to run Automator workflows from your application.
ja: NSUser Automator Taskクラスは、Automatorワークフローをあなたのアプリケーションから実行するためのものです。

source: The NSUser Script Task class is able to run all the scripts normally run by the one of its subclasses, however it ignores the results.
ja: NSUser Script Taskクラスは、それのサブクラスの１つによって正常に実行されるスクリプト全てを実行できます、しかしながらそれは結果を無視します。

source: The NSUser Unix Task class is intended to run unix applications, typically a shell script, from your application.
ja: NSUser Unix Taskクラスは、unixアプリケーション、大抵はシェルスクリプト、をあなたのアプリケーションから実行するためのものです。

source: The Time Zone to use.
ja: 使用するTime Zone。

source: The URL to read.
ja: 読み込むURL。

source: The _cmd variable is a hidden argument passed to every method that is the current selector; in this example, it identifies the selector for the copy method.
ja: _cmd変数は、ある隠された引数で、現在のセレクタであるどのメソッドにも渡されます；この例において、それはcopyメソッドに対するセレクタを識別します。

source: The comparator message is sent to each object in the array and has as its single argument another object in the array.
ja: comparatorメッセージは、配列の中の各オブジェクトに送られます、そしてそれのただ１つの引数として配列の中の別のオブジェクトを持ちます。

source: The convert From Snake Case strategy can't infer capitalization for acronyms or initialisms such as WYSIWYG or URI.
ja: convert From Snake Case戦略は、の略称または頭文字語、例えばWYSIWYGまたはURIに対して頭文字化を推論できません。

source: The copy(with:) method performs a shallow copy.
ja: copy(with:)メソッドは、浅いコピーを行います。

source: The forward Invocation: message thus allows an object to establish relationships with other objects that will, for certain messages, act on its behalf.
ja: forward Invocation:メッセージはこのようにあるオブジェクトに、それの代行を、特定のメッセージに対して、務める他のオブジェクトとの関係（リレーションシップ）を確立させます。

source: The handler Refcon parameter provides 4 bytes of data to the handler; a common use for this parameter is to pass a pointer to additional data.
ja: handler Refconパラメータは４バイトのデータをハンドラに提供します；このパラメータの通常の使用法は、ポインタを追加的なデータに渡すことになります。

source: The is Directory out parameter indicates whether the path points to a directory or a regular file.
ja: is Directoryアウトパラメータは、パスがディレクトリまたは通常ファイルを指し示すかどうかを指し示します。

source: The isa instance variable of the new instance is initialized to a data structure that describes the class; memory for all other instance variables is set to 0.
ja: 新しいインスタンスのisaインスタンス変数は、このクラスを記述するデータ構造に初期化されます；他の全てのインスタンス変数のメモリは0に設定されます。

source: The next Partial Result closure is called sequentially with an accumulating value initialized to initial Result and each element of the sequence.
ja: next Partial Resultクロージャはinitial Resultに初期化された蓄積値およびシーケンスの各要素とともに連続して呼び出されます。

source: The next Partial Result closure is called with initial Result—0 in this case—and the first element of numbers, returning the sum: 1.
ja: next Partial Resultクロージャが、initial Result—この場合では0とnumbersの最初の要素とともに呼び出されて、その合計：1を返します。

source: The notification Info dictionary is serialized as a property list, so it can be passed to another task.
ja: notification Info辞書はプロパティリストとしてシリアライズされます、それでそれは別のタスクに渡されることができます。

source: The numbers array is now arranged in two partitions.
ja: numbers配列は今や２つの区画に整頓されます。

source: The scale value specifies the number of digits result can have after its decimal point.
ja: scale値は、resultがそれの小数点の後に持つことができる桁数を指定します。

source: The the Reply parameter always specifies a reply Apple event, never nil.
ja: the Replyパラメータは常にある返答アップルイベントを指定します、決してnilではありません。

source: The update Accumulating Result closure is called sequentially with a mutable accumulating value initialized to initial Result and each element of the sequence.
ja: update Accumulating Resultクロージャは、initial Resultに初期化された可変の蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The update Accumulating Result closure is called with the initial accumulating value—[:] in this case—and the first character of letters, modifying the accumulating value by setting 1 for the key "a".
ja: update Accumulating Resultクロージャが、初期蓄積値—この場合では[:]—およびlettersの最初の文字とともに呼び出されて、1をキー"a"に対して設定することで蓄積値を修正します。

source: The use Default Keys strategy is the strategy used if you don't specify one.
ja: use Default Keys戦略は、あなたが指定するものがないならば使用する戦略です。

source: The user Info dictionary is serialized as a property list, so it can be passed to another task.
ja: user Info辞書はプロパティリストとしてシリアライズされます、それでそれは別のタスクに渡されることができます。

source: The stop argument is an out-only argument.
ja: stop引数は、ひとつの退出専用引数です。

source: The File Manager class provides convenient access to a shared file manager object that is suitable for most types of file-related manipulations.
ja: File Managerクラスは、便利なアクセスを共有ファイルマネージャオブジェクトに対して提供します、それはファイル関連操作のほとんどの型に適します。

source: The NSDate Interval class provides a programmatic interface for calculating the duration of a time interval and determining whether a date falls within it, as well as comparing date intervals and checking to see whether they intersect.
ja: NSDate Intervalクラスは、プログラム的なインターフェイスをある時間間隔の期間を計算したり、ある日付がそれの内に入るかどうか、それだけでなく日付間隔を比較してそれらが交差かどうかを判定するために提供します。

source: The NSUnknown Key Specifier Error and NSInvalid Index Specifier Error numbers are special, in that Cocoa may continue evaluating an outer specifier if they're encountered, for the convenience of scripters.
ja: NSUnknown Key Specifier ErrorとNSInvalid Index Specifier Errorナンバーは特別です、スクリプト記述者の便宜のために、Cocoaは外部の指定子の評価をそれらに出くわしたならば継続するという点において。

source: The remove Last() method must be used only on a nonempty collection.
ja: remove Last()メソッドは、空でないコレクションでのみ使われるべきです。

source: The user Info dictionary contains the following information:
ja: user Info辞書は、以下の情報を含みます：

source: The Coordinate instance's two properties are initialized using the keyed container APIs provided by the Swift standard library.
ja: Coordinateインスタンスのもつ２つのプロパティは、Swift標準ライブラリによって提供されるキー付きコンテナAPIを使って初期化されます。
